In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("Rain.csv",nrows = 3)
df

      Location   PL    AL  Number of days
0     New York  3.5  47.7             122
1  Los Angeles  0.8  14.9              36
2        Miami  5.2  61.9             128

In [8]:
df.to_csv("new.csv",columns =["Location","AL"],index =False )
pf = pd.read_csv("new.csv",nrows = 3)
pf

      Location    AL
0     New York  47.7
1  Los Angeles  14.9
2        Miami  61.9

In [ ]:
#dropna to drop fillna to fill and interpolate to make a guess
# parse_dates[name of column ]

In [11]:
df = pd.read_csv("new.csv")
df
df.fillna(0)

      Location    AL
0     New York  47.7
1  Los Angeles  14.9
2        Miami  61.9
3          USA   0.0
4           UK   0.0
5        India  99.9

In [ ]:
df = pd.read_csv("new.csv")
df
df.fillna(0)
# fillna({
#key pair for partiuclar col and values
#})
#in argument if method = ffil and bfill 
nf = df.dropna(how="all") #this will put Nan in place of nothing and also thresh =3 means three col are empty it will skip the line
nf.replace(-99999,np.NaN) #it will replace value of -99999 to NaN and as first argument we can add more bvalues as an list